Ran Plan for project: `terraform-aws-dev` dir: `dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_s3_bucket.example: Reading...
data.aws_s3_bucket.example: Read complete after 0s [id=test-c9ef9c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
+ resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-bucket-c9ef9c"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "test-bucket-c9ef9c"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "test-bucket-c9ef9c"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.test will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "test" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-southeast-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cleanup-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }
        }
    }

  # aws_s3_bucket_ownership_controls.test will be created
+ resource "aws_s3_bucket_ownership_controls" "test" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-2"

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_public_access_block.test will be created
+ resource "aws_s3_bucket_public_access_block" "test" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-southeast-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.test will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "test" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-2"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.test will be created
+ resource "aws_s3_bucket_versioning" "test" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
- bucket_id     = "test-c9ef9c" -> null
- bucket_region = "ap-southeast-2" -> null
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p terraform-aws-dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.dev.geonet.cloud/lock?id=cloudbuildlab%252Fatlantis-terraform-aws%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p terraform-aws-dev
  ```
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```